male_names = [
    'Александр', 'Алексей', 'Анатолий', 'Андрей', 'Антон', 'Аркадий', 'Артем', 'Борис', 'Вадим', 
    'Валентин', 'Валерий', 'Василий', 'Виктор', 'Виталий', 'Владимир', 'Владислав', 'Вячеслав', 
    'Геннадий', 'Георгий', 'Григорий', 'Даниил', 'Денис', 'Дмитрий', 'Евгений', 'Егор', 'Иван', 
    'Игорь', 'Илья', 'Кирилл', 'Константин', 'Лев', 'Леонид', 'Макар', 'Максим', 'Матвей', 
    'Михаил', 'Никита', 'Николай', 'Олег', 'Павел', 'Петр', 'Роман', 'Руслан', 'Сергей', 
    'Станислав', 'Степан', 'Тимофей', 'Федор', 'Юрий', 'Яков', 'Ярослав', 'Арсений', 'Богдан', 
    'Всеволод', 'Глеб', 'Давид', 'Захар', 'Иван', 'Марк', 'Мирослав', 'Родион', 'Савва', 'Святослав',
    'Тимур', 'Тихон', 'Филипп', 'Эдуард', 'Альберт', 'Игнат', 'Прохор', 'Ростислав', 'Семен'
]

female_names = [
    'Александра', 'Алена', 'Алина', 'Алиса', 'Алла', 'Анастасия', 'Анна', 'Валентина', 'Валерия', 
    'Варвара', 'Василиса', 'Вера', 'Вероника', 'Виктория', 'Галина', 'Дарья', 'Диана', 'Ева', 
    'Евгения', 'Екатерина', 'Елена', 'Елизавета', 'Жанна', 'Зинаида', 'Зоя', 'Ирина', 'Кира', 
    'Ксения', 'Лариса', 'Лидия', 'Лилия', 'Любовь', 'Людмила', 'Майя', 'Маргарита', 'Марина', 
    'Мария', 'Милана', 'Надежда', 'Наталья', 'Нелли', 'Нина', 'Оксана', 'Олеся', 'Ольга', 
    'Полина', 'Раиса', 'Регина', 'Светлана', 'Снежана', 'Софья', 'Таисия', 'Тамара', 'Татьяна',
    'Ульяна', 'Фаина', 'Юлия', 'Яна', 'Анфиса', 'Арина', 'Влада', 'Жанна', 'Карина', 'Кристина'
]

last_names = [
    'Иванов', 'Смирнов', 'Кузнецов', 'Попов', 'Васильев', 'Петров', 'Соколов', 'Михайлов', 
    'Новиков', 'Федоров', 'Морозов', 'Волков', 'Алексеев', 'Лебедев', 'Семенов', 'Егоров', 
    'Павлов', 'Козлов', 'Степанов', 'Николаев', 'Орлов', 'Андреев', 'Макаров', 'Никитин', 
    'Захаров', 'Зайцев', 'Соловьев', 'Борисов', 'Яковлев', 'Григорьев', 'Романов', 'Воробьев', 
    'Сергеев', 'Кузьмин', 'Фролов', 'Александров', 'Дмитриев', 'Королев', 'Гусев', 'Киселев', 
    'Ильин', 'Максимов', 'Поляков', 'Сорокин', 'Виниченко', 'Тихонов', 'Жуков', 'Беляев', 
    'Федотов', 'Ершов', 'Никонов', 'Комаров', 'Быков', 'Куликов', 'Леонов', 
    'Марков', 'Горбунов', 'Крылов', 'Ковалев', 'Соболев', 'Трофимов', 'Ефимов', 'Лазарев', 
    'Медведев', 'Абрамов', 'Мартынов', 'Ефремов', 'Исаев', 'Брагин', 'Шмелев', 'Матвеев', 
    'Блинов', 'Мельников', 'Щукин', 'Носов', 'Гаврилов', 'Родионов', 'Котов', 'Горшков', 
    'Горячев', 'Рябов', 'Чернов', 'Журавлев', 'Калинин', 'Мельников', 'Калашников', 'Маслов', 
    'Панов', 'Чижов', 'Назаров', 'Суворов', 'Нефедов', 'Кудрявцев', 'Прохоров', 'Богданов', 
    'Лапин', 'Сафонов', 'Кондратьев', 'Селиванов', 'Кулибин', 'Пахомов', 'Сычев', 'Воронцов', 
    'Фомин'
]

male_patronymics = [
    "Алексеевич", "Борисович", "Викторович", "Геннадиевич", "Дмитриевич",
    "Евгеньевич", "Иванович", "Кириллович", "Леонидович", "Михайлович",
    "Николаевич", "Олегович", "Петрович", "Романович", "Сергеевич",
    "Тимурович", "Ульянович", "Федорович", "Христофорович", "Эдуардович",
    "Яковлевич", "Антонович", "Владимирович", "Станиславович", "Станиславович",
    "Ярославович", "Игоревич", "Андреевич", "Никитич", "Тихонович"
]

female_patronymics = [
    "Алексеевна", "Борисовна", "Викторовна", "Геннадиевна", "Дмитриевна",
    "Евгеньевна", "Ивановна", "Кирилловна", "Леонидовна", "Михайловна",
    "Николаевна", "Олеговна", "Петровна", "Романовна", "Сергеевна",
    "Тимуровна", "Ульяновна", "Федоровна", "Христофоровна", "Эдуардовна",
    "Яковлевна", "Антоновна", "Владимировна", "Станиславовна", "Тихоновна",
    "Денисовна", "Кирилловна", "Мироновна", "Ярославовна", "Екатериновна"
]
